/* filename: use_printf.c */

#include <stdio.h>

int main(int argc, char *argv[])
{
    int i = 47;
    // printf("初始定义的变量i = %d\n", i);
    // // 以十进制形式输出带符号整数(正数不输出符号)
    // printf("以十进制形式输出: %d\n", i);
    // // 以八进制形式输出无符号整数(不输出前缀0)
    // printf("以八进制形式输出: %o\n", i);
    // // 以十六进制形式输出小写无符号整数
    // printf("以十六进制小写形式输出: %x\n", i);
    // // 以十六进制形式输出大写无符号整数
    // printf("以十六进制大写形式输出: %X\n", i);
    // // 以标准十六进制形式输出小写无符号整数
    // printf("以标准十六进制小写形式输出: %#x\n", i);
    // // 以标准十六进制形式输出大写无符号整数
    // printf("以标准十六进制大写形式输出: %#X\n", i);
    // printf("以十进制无符号形式输出: %u\n", i);

    // char s[20] = "string";
    // printf("宽度为10，默认右对齐输出字符串: 【%10s】\n", s);
    // printf("宽度为10，左对齐输出字符串: 【%-10s】\n", s);

    // 数字前的填充
    printf("宽度为10，右对齐输出字符串: 【%10d】\n", i);
    printf("宽度为10，右对齐输出字符串: 【%010d】\n", i);

    // 显示正负号
    printf("正数，默认不显示正号: 【%d】\n", i);
    printf("正数，使用+加号显示正号: 【%+d】\n", i);
    printf("负数，默认会显示负号: 【%d】\n", -i);
    printf("负数，默认会显示负号: 【%+d】\n", -i);


    return 0;
}
